In [1]:
import pandas as pd
import numpy as np

In [3]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(data=my_list,index=d)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [21]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [24]:
ser1 = pd.Series(data=[1,2,3], index=['USA','Germany','Paris'])

In [25]:
ser1

USA        1
Germany    2
Paris      3
dtype: int64

In [26]:
ser2 = pd.Series(data=[1,2,3,4],index=['Germany','Paris','USA','India'])

In [27]:
ser2

Germany    1
Paris      2
USA        3
India      4
dtype: int64

In [34]:
ser1 + ser2

Germany    3.0
India      NaN
Paris      5.0
USA        4.0
dtype: float64

In [36]:
ser1['USA']

1

In [37]:
#DATAFRAMES

In [1]:
from numpy.random import randn

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(data = randn(5,4),index = 'A B C D E'.split() , columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [7]:
df['W']

A    1.997609
B   -1.187591
C    0.254756
D    1.046259
E   -1.027138
Name: W, dtype: float64

In [15]:
type(df[['W','X']])

pandas.core.frame.DataFrame

In [17]:
df[['W','X']]

          W         X
A  1.997609  0.159739
B -1.187591  0.417323
C  0.254756 -1.745382
D  1.046259  1.632330
E -1.027138 -0.293792

In [19]:
df['new'] = df['W'] + df['X']

In [22]:
df['new']

A    2.157348
B   -0.770268
C   -1.490626
D    2.678590
E   -1.320930
Name: new, dtype: float64

In [23]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [24]:
df

          W         X         Y         Z       new
A  1.997609  0.159739 -0.069159 -1.238152  2.157348
B -1.187591  0.417323 -0.389980 -0.873924 -0.770268
C  0.254756 -1.745382 -0.367782  1.555599 -1.490626
D  1.046259  1.632330  0.739860  1.219048  2.678590
E -1.027138 -0.293792 -1.153364  0.534326 -1.320930

In [25]:
df.drop('new',axis = 1,inplace = True)

In [26]:
df

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [27]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048

In [28]:
df.drop('E')

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048

In [29]:
df

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [32]:
df.loc[['A','B']]

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924

In [33]:
df.loc[['A']]

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152

In [34]:
df.loc['A']

W    1.997609
X    0.159739
Y   -0.069159
Z   -1.238152
Name: A, dtype: float64

In [35]:
df.iloc[0]

W    1.997609
X    0.159739
Y   -0.069159
Z   -1.238152
Name: A, dtype: float64

In [36]:
df.iloc[[0,1,2]]

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599

In [45]:
df.iloc[[True,True,True,False,False]]

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599

In [46]:
df.loc['B','Y']

-0.38997981090034767

In [55]:
df.loc['A':'C','W']

A    1.997609
B   -1.187591
C    0.254756
Name: W, dtype: float64

In [58]:
df

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [57]:
df[df['W']>0]

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048

In [63]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.069159  0.159739
C -0.367782 -1.745382
D  0.739860  1.632330

In [64]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [65]:
df

          W         X         Y         Z
A  1.997609  0.159739 -0.069159 -1.238152
B -1.187591  0.417323 -0.389980 -0.873924
C  0.254756 -1.745382 -0.367782  1.555599
D  1.046259  1.632330  0.739860  1.219048
E -1.027138 -0.293792 -1.153364  0.534326

In [70]:
df.reset_index(inplace=False)

   level_0 index         W         X         Y         Z
0        0     A  1.997609  0.159739 -0.069159 -1.238152
1        1     B -1.187591  0.417323 -0.389980 -0.873924
2        2     C  0.254756 -1.745382 -0.367782  1.555599
3        3     D  1.046259  1.632330  0.739860  1.219048
4        4     E -1.027138 -0.293792 -1.153364  0.534326

In [71]:
df

  index         W         X         Y         Z
0     A  1.997609  0.159739 -0.069159 -1.238152
1     B -1.187591  0.417323 -0.389980 -0.873924
2     C  0.254756 -1.745382 -0.367782  1.555599
3     D  1.046259  1.632330  0.739860  1.219048
4     E -1.027138 -0.293792 -1.153364  0.534326

In [73]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [74]:
df['States'] = ['CA','IND','US','GER','JPN']

In [79]:
df.set_index('States',inplace=True)

In [80]:
df.index

Index(['CA', 'IND', 'US', 'GER', 'JPN'], dtype='object', name='States')

In [81]:
df

       index         W         X         Y         Z
States
CA         A  1.997609  0.159739 -0.069159 -1.238152
IND        B -1.187591  0.417323 -0.389980 -0.873924
US         C  0.254756 -1.745382 -0.367782  1.555599
GER        D  1.046259  1.632330  0.739860  1.219048
JPN        E -1.027138 -0.293792 -1.153364  0.534326

In [82]:
outside = ['G1','G1','G1','G2','G2','G2']
list(zip(outside))

[('G1',), ('G1',), ('G1',), ('G2',), ('G2',), ('G2',)]

In [91]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,np.nan]}

In [92]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, nan]}

In [93]:
df = pd.DataFrame(data)

In [94]:
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0
5      FB    Sarah    NaN

In [95]:
df.dropna()

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0

In [96]:
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0
5      FB    Sarah    NaN

In [98]:
df.fillna(value = 350,inplace = True)

In [99]:
df

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0
5      FB    Sarah  350.0

In [101]:
by_comp = df.groupby('Company')

In [102]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [108]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [113]:
by_comp.describe().transpose()[['GOOG']]

Company            GOOG
Sales count    2.000000
      mean   160.000000
      std     56.568542
      min    120.000000
      25%    140.000000
      50%    160.000000
      75%    180.000000
      max    200.000000

In [132]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [133]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [134]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [135]:
pd.concat([left,right],axis = 0)

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K3  NaN  NaN   C3   D3

In [136]:
pd.concat([left,right],axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [137]:
pd.merge(left,right,how='outer',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [138]:
df.head()

  Company   Person  Sales
0    GOOG      Sam  200.0
1    GOOG  Charlie  120.0
2    MSFT      Amy  340.0
3    MSFT  Vanessa  124.0
4      FB     Carl  243.0

In [139]:
df['Company'].unique()

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [140]:
df['Company'].nunique()

3

In [141]:
df['Company'].value_counts()

GOOG    2
MSFT    2
FB      2
Name: Company, dtype: int64